<?php
// +----------------------------------------------------------------------
// | model层
// +----------------------------------------------------------------------
// | Author: zjh <temp2016good@163.com>
// +----------------------------------------------------------------------
// | Date: 2018-04-11
// +----------------------------------------------------------------------

namespace apps\common\model;


use think\Model;

class InvUser extends Model {


	/**
	 * 获取一个数据
	 * @param   [type]  $id  [description]
	 * @return  [type]       [description]
	 */
    public function user($id)
    {
    	
    }


}
